# Shopify Data Science Internship Challenge - Junita Sirait

Below is the code I used to analyze the csv file given to me as part of this challenge. For the full descriptions and answer to the questions in the challenge, **please refer to the pdf in the same GitHUb repo**. Thank you!

In [3]:
import pandas as pd

In [8]:
!pip install matplotlib

Collecting matplotlib
  Downloading matplotlib-3.3.1-1-cp38-cp38-win_amd64.whl (8.9 MB)
Requirement already satisfied: pyparsing!=2.0.4,!=2.1.2,!=2.1.6,>=2.0.3 in c:\users\user200803\appdata\local\programs\python\python38\lib\site-packages (from matplotlib) (2.4.7)
Requirement already satisfied: python-dateutil>=2.1 in c:\users\user200803\appdata\local\programs\python\python38\lib\site-packages (from matplotlib) (2.8.1)
Collecting kiwisolver>=1.0.1
  Downloading kiwisolver-1.2.0-cp38-none-win_amd64.whl (58 kB)
Requirement already satisfied: certifi>=2020.06.20 in c:\users\user200803\appdata\local\programs\python\python38\lib\site-packages (from matplotlib) (2020.6.20)
Collecting pillow>=6.2.0
  Downloading Pillow-7.2.0-cp38-cp38-win_amd64.whl (2.1 MB)
Requirement already satisfied: numpy>=1.15 in c:\users\user200803\appdata\local\programs\python\python38\lib\site-packages (from matplotlib) (1.19.1)
Collecting cycler>=0.10
  Downloading cycler-0.10.0-py2.py3-none-any.whl (6.5 kB)
Requirement already satisfied: six>=1.5 in c:\users\user200803\appdata\roaming\python\python38\site-packages (from python-dateutil>=2.1->matplotlib) (1.15.0)
Installing collected packages: kiwisolver, pillow, cycler, matplotlib
Successfully installed cycler-0.10.0 kiwisolver-1.2.0 matplotlib-3.3.1 pillow-7.2.0

In [9]:
import matplotlib.pyplot as plt

In [4]:
with open("2019 Winter Data Science Intern Challenge Data Set - Sheet1.csv", "r") as f:
    df = pd.read_csv(f)
    
df.head()

,order_id,shop_id,user_id,order_amount,total_items,payment_method,created_at
0,1,53,746,224,2,cash,2017-03-13 12:36:56
1,2,92,925,90,1,cash,2017-03-03 17:38:52
2,3,44,861,144,1,cash,2017-03-14 4:23:56
3,4,18,935,156,1,credit_card,2017-03-26 12:43:37
4,5,18,883,156,1,credit_card,2017-03-01 4:35:11

In [18]:
df.shape

(5000, 7)

In [20]:
subset_df = df[df["total_items"]>1000]
subset_df.shape

(17, 7)

In [21]:
subset_df

,order_id,shop_id,user_id,order_amount,total_items,payment_method,created_at
4868,4869,42,607,704000,2000,credit_card,2017-03-22 4:00:00
1104,1105,42,607,704000,2000,credit_card,2017-03-24 4:00:00
4056,4057,42,607,704000,2000,credit_card,2017-03-28 4:00:00
3332,3333,42,607,704000,2000,credit_card,2017-03-24 4:00:00
1362,1363,42,607,704000,2000,credit_card,2017-03-15 4:00:00
4882,4883,42,607,704000,2000,credit_card,2017-03-25 4:00:00
1436,1437,42,607,704000,2000,credit_card,2017-03-11 4:00:00
2969,2970,42,607,704000,2000,credit_card,2017-03-28 4:00:00
4646,4647,42,607,704000,2000,credit_card,2017-03-02 4:00:00
2835,2836,42,607,704000,2000,credit_card,2017-03-28 4:00:00
2297,2298,42,607,704000,2000,credit_card,2017-03-07 4:00:00
520,521,42,607,704000,2000,credit_card,2017-03-02 4:00:00
2153,2154,42,607,704000,2000,credit_card,2017-03-12 4:00:00
1602,1603,42,607,704000,2000,credit_card,2017-03-17 4:00:00
1562,1563,42,607,704000,2000,credit_card,2017-03-19 4:00:00
15,16,42,607,704000,2000,credit_card,2017-03-07 4:00:00
60,61,42,607,704000,2000,credit_card,2017-03-04 4:00:00

In [22]:
subset2 = df[df["total_items"]<=1000]
subset2.shape

(4983, 7)

In [23]:
subset2["total_items"].mean()

1.9939795304033714

In [24]:
subset_df["total_items"].mean()

2000.0

In [26]:
# AOV of 4983 orders with items < 2000 each
subset2["order_amount"].mean()

754.0919125025085

In [27]:
# AOV of 17 orders with items = 2000 each
subset_df["order_amount"].mean()

704000.0

In [28]:
# initial AOV of all orders
df["order_amount"].mean()

3145.128

In [25]:
subset3 = df[df["user_id"]==607]
subset3.shape

(17, 7)

In [29]:
1700/5000

0.34

In [30]:
df['user_id'].nunique()

301

In [37]:
df['user_id'].shape

(5000,)

In [45]:
id_user = df.user_id.unique() # user id's
dd = {}
dd['user_id'] = id_user
total_order_amount_list = []
for uu in id_user:
    total_order_amount = df[df['user_id']==uu]['order_amount'].sum()
    total_order_amount_list.append(total_order_amount)
dd['total_order_amount'] = total_order_amount_list
dfin = pd.DataFrame(dd)
dfin.sort_values(by='total_order_amount', ascending=False)

     user_id  total_order_amount
300      607            11968000
202      878              156936
285      834              108342
245      787               85707
59       969               84269
..       ...                 ...
213      750                2359
299      717                2337
274      719                2314
18       939                2196
81       902                2108

[301 rows x 2 columns]